Repository: Metal-666/file_structure_toolkit
Catalog: lib/l10n/app_*.arb
Languages: uk

# menuBar_scanButton
source: Scan
uk: Сканувати

# menuBar_importButton
source: Import
uk: Імпортувати

# menuBar_languageDropdown_title
source: Language:
uk: Мова:

# menuBar_themeDropdown_title
source: Theme:
uk: Тема:

# menuBar_themeDropdown_tooltip
source: Change theme
uk: Змінити тему

# dialog_scan_title
source: Pick Directory to Scan:
uk: Оберіть Директорію для Сканування:

# dialog_import_title
source: Pick File to Import:
uk: Оберіть Файл для Імпорту:

# dialog_export_title
source: Export Scan Results:
uk: Експорт Результату Сканування:

# dialog_failedFiles_title
source: Some files failed to load:
uk: Не вдалося імпортувати деякі файли:

# dialog_failedFiles_okButton
source: OK
uk: ОК

# treePanel_header_missingElementsLabel
source: {missingElementsCount, plural, =0{No missing elements!} other{Missing elements: {missingElementsCount}}}
uk: {missingElementsCount, plural, =0{Всі елементи співпадають!} other{Знайдено розбіжностей: {missingElementsCount}}}

# treePanel_header_exportButton_tooltip
source: Export tree to file
uk: Експортувати дерево до файлу

# treePanel_header_collapseButton_tooltip
source: Collapse/Expand
uk: Згорнути/Розгорнути

# treePanel_header_closeButton_tooltip
source: Close tree
uk: Закрити

# treePanel_tree_element_scanFailedLabel
source: {elementName} [SCAN FAILED: {scanError}]
uk: {elementName} [НЕМОЖЛИВО СКАНУВАТИ: {scanError}]

# overlay_drop_centerLabel
source: <Drop file here>
uk: <Перетягніть файл сюди>

# overlay_scan_centerLabel
source: Scanning directory: {directoryName}
uk: Сканується директорія: {directoryName}

# overlay_scan_cancelButton
source: Cancel
uk: Відмінити
